"use strict";

// Дан массив с числами. Переберите этот массив циклом и возведите каждый элемент этого массива в квадрат.
// const arr = [1, 2, 3, 4, 5];

// for (let i = 0; i < arr.length; i++) {
//   arr[i] = arr[i] ** 2;
// }

// console.log(arr);

// Дан массив с числами. Переберите этот массив циклом и отнимите от каждого элемента единицу.
// const arr = [1, 2, 3, 4, 5];

// for (let i = 0; i < arr.length; i++) {
//   arr[i] = arr[i] - 1;
// }

// console.log(arr);

// Дан массив с числами. Переберите этот массив циклом и прибавьте к каждому элементу 10.
const arr = [1, 2, 3, 4, 5];

for (let i = 0; i < arr.length; i++) {
  arr[i] = arr[i] + 10;
}

console.log(arr);
